IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_TIMEOUT0_CFG.xml
<module name="MCU_TIMEOUT0_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_PID" acronym="CFG_PID" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1542" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x4" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_CFG" acronym="CFG_CFG" offset="0x4" width="32" description="The Configuration Register contains information about the configuration of the gasket.">
		<bitfield id="NUM_WRITES" width="8" begin="23" end="16" resetval="0x9" description="Total Number of slots in the write scoreboard" range="23 - 16" rwaccess="R"/> 
		<bitfield id="NUM_READS" width="8" begin="7" end="0" resetval="0x15" description="Total Number of slots in the read scoreboard" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_INFO" acronym="CFG_INFO" offset="0x8" width="32" description="The Info Register contains information about the current state of the gasket.">
		<bitfield id="CUR_WRITES" width="9" begin="24" end="16" resetval="0x0" description="Total Number of slots in the write scoreboard" range="24 - 16" rwaccess="R"/> 
		<bitfield id="CUR_READS" width="9" begin="8" end="0" resetval="0x0" description="Total Number of slots in the read scoreboard" range="8 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_ENABLE" acronym="CFG_ENABLE" offset="0xC" width="32" description="The Enable Register contains the gasket enable.">
		<bitfield id="EN" width="4" begin="3" end="0" resetval="0x0" description="Enable. 0 - Disabled, All other values - Enabled." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_FLUSH" acronym="CFG_FLUSH" offset="0x10" width="32" description="The Flush Register contains software flush control.">
		<bitfield id="EXT_FL" width="1" begin="31" end="31" resetval="0x0" description="External Flush Value" range="31" rwaccess="R"/> 
		<bitfield id="FL" width="4" begin="3" end="0" resetval="0x0" description="Enable. 4'b1111 - Flush, All other values - Normal." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TIMEOUT" acronym="CFG_TIMEOUT" offset="0x14" width="32" description="The Timeout Value Register contains the timeout value for scoreboarded transactions.">
		<bitfield id="TO" width="30" begin="29" end="0" resetval="0x1073741823" description="The number of cycles in each eon." range="29 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TIMER" acronym="CFG_TIMER" offset="0x18" width="32" description="The Timer Register contains the current value for free-running timer. ">
		<bitfield id="EON" width="2" begin="31" end="30" resetval="0x0" description="Current eon" range="31 - 30" rwaccess="R"/> 
		<bitfield id="CNTR" width="30" begin="29" end="0" resetval="0x0" description="Current value of the free-running timer" range="29 - 0" rwaccess="R/WTC"/>
	</register>
	<register id="CFG_ERR_RAW" acronym="CFG_ERR_RAW" offset="0x20" width="32" description="This register contains the masked interrupt bits">
		<bitfield id="CMD" width="1" begin="2" end="2" resetval="0x0" description="Raw Command Error Interrupt" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="UNEXP" width="1" begin="1" end="1" resetval="0x0" description="Raw Unexpected Error Interrupt" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="Raw Timeout Error Interrupt" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_ERR" acronym="CFG_ERR" offset="0x24" width="32" description="This register contains the masked interrupt bits">
		<bitfield id="CMD" width="1" begin="2" end="2" resetval="0x0" description="Masked Command Error Interrupt" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="UNEXP" width="1" begin="1" end="1" resetval="0x0" description="Masked Unexpected Error Interrupt" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="TIMEOUT" width="1" begin="0" end="0" resetval="0x0" description="Masked Timeout Error Interrupt" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_ERR_MSK_SET" acronym="CFG_ERR_MSK_SET" offset="0x28" width="32" description="This register contains interrupt mask set bits">
		<bitfield id="CMD" width="1" begin="2" end="2" resetval="0x1" description="Raw Command Error Interrupt Mask Set" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="UNEXP" width="1" begin="1" end="1" resetval="0x1" description="Raw Unexpected Error Interrupt Mask Set" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="TIMEOUT" width="1" begin="0" end="0" resetval="0x1" description="Raw Timeout Error Interrupt Mask Set" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_ERR_MSK_CLR" acronym="CFG_ERR_MSK_CLR" offset="0x2C" width="32" description="This register contains interrupt mask clear bits">
		<bitfield id="CMD" width="1" begin="2" end="2" resetval="0x1" description="Raw Command Error Interrupt Mask Clear" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="UNEXP" width="1" begin="1" end="1" resetval="0x1" description="Raw Unexpected Error Interrupt Mask Clear" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="TIMEOUT" width="1" begin="0" end="0" resetval="0x1" description="Raw Timeout Error Interrupt Mask Clear" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_ERR_TM_INFO" acronym="CFG_ERR_TM_INFO" offset="0x30" width="32" description="This register contains information about timeout interrupts">
		<bitfield id="CNT" width="2" begin="1" end="0" resetval="0x0" description="Timeout Interrupt Count" range="1 - 0" rwaccess="R/WTD"/>
	</register>
	<register id="CFG_ERR_UN_INFO" acronym="CFG_ERR_UN_INFO" offset="0x34" width="32" description="This register contains information about unexpected interrupts">
		<bitfield id="CNT" width="2" begin="1" end="0" resetval="0x0" description="Unexpected Interrupt Count" range="1 - 0" rwaccess="R/WTD"/>
	</register>
	<register id="CFG_ERR_VAL" acronym="CFG_ERR_VAL" offset="0x38" width="32" description="This register contains information about transaction that caused the interrupt">
		<bitfield id="RID" width="12" begin="27" end="16" resetval="0x0" description="Route ID Indicator" range="27 - 16" rwaccess="R"/> 
		<bitfield id="OID" width="4" begin="11" end="8" resetval="0x0" description="Order ID Indicator" range="11 - 8" rwaccess="R"/> 
		<bitfield id="DIR" width="1" begin="2" end="2" resetval="0x0" description="Direction Indicator" range="2" rwaccess="R"/> 
		<bitfield id="TYP" width="1" begin="1" end="1" resetval="0x0" description="Type Indicator" range="1" rwaccess="R"/> 
		<bitfield id="VAL" width="1" begin="0" end="0" resetval="0x0" description="Valid Indicator" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_ERR_TAG" acronym="CFG_ERR_TAG" offset="0x3C" width="32" description="This register contains information about transaction that caused the interrupt">
		<bitfield id="TAG" width="12" begin="27" end="16" resetval="0x0" description="Command Tag Indicator" range="27 - 16" rwaccess="R"/> 
		<bitfield id="CID" width="12" begin="11" end="0" resetval="0x0" description="Command ID Indicator" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_ERR_BYT" acronym="CFG_ERR_BYT" offset="0x40" width="32" description="This register contains information about transaction that caused the interrupt">
		<bitfield id="CBYTECNT" width="10" begin="25" end="16" resetval="0x0" description="Current Bytecnt" range="25 - 16" rwaccess="R"/> 
		<bitfield id="OBYTECNT" width="10" begin="9" end="0" resetval="0x0" description="Original Bytecnt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_ERR_ADDR_U" acronym="CFG_ERR_ADDR_U" offset="0x44" width="32" description="This register contains information about transaction that caused the interrupt">
		<bitfield id="ADDR" width="32" begin="31" end="0" resetval="0x0" description="Upper bits of the Address" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_ERR_ADDR_L" acronym="CFG_ERR_ADDR_L" offset="0x48" width="32" description="This register contains information about transaction that caused the interrupt">
		<bitfield id="ADDR" width="32" begin="31" end="0" resetval="0x0" description="Lower bits of the Address" range="31 - 0" rwaccess="R"/>
	</register>
</module>